const btn = document.querySelector('.j-btn-test');

const svg_1 = document.querySelector('.bi-arrow-down-left-circle');
const svg_2 = document.querySelector('.bi-arrow-down-left-circle-fill');




// Этот код относится к JavaScript и используется для добавления или удаления класса 
// с именем "btn--magic" элемента на странице, который имеет класс "btn".

// Метод classList.toggle() является встроенной функцией в объекте classList, 
// который является свойством элемента DOM (объекта модели документа). 
// Этот метод принимает один аргумент - имя класса и работает следующим образом:

// Если класс уже присутствует на элементе, то он удаляется
//  (т.е. переключается в неактивное состояние), и метод возвращает false.
// Если класс отсутствует на элементе, то он добавляется
//  (т.е. переключается в активное состояние), и метод возвращает true.
// Таким образом, когда код btn.classList.toggle('btn--magic') выполняется, 
// он проверяет, есть ли у элемента с классом "btn" класс "btn--magic". 
// Если класс есть, то он удаляется, а если его нет, то он добавляется. 
// Таким образом, данный код позволяет "включать" и "выключать" класс "btn--magic" для элемента на странице.

btn.addEventListener('click', () => {
  btn.classList.toggle('btn--magic');
  svg_1.classList.toggle('hidden')
  svg_2.classList.toggle('hidden')
});